app/controllers/goals_controller.rb

INSERT INTO "goals" ("title", "body", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "New"], ["body", "New"], ["created_at", "2020-07-21 08:35:44.749333"], ["updated_at", "2020-07-21 08:35:44.749333"], ["user_id", 10]]
---
  def create
    @goal = Goal.new(goal_params)

    if @goal.save

UPDATE "goals" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "goals"."id" = $4  [["title", "please work"], ["body", "working?"], ["updated_at", "2020-07-11 07:20:00.593695"], ["id", 5]]
---
  def update
    if @goal.update(goal_params)

DELETE FROM "goals" WHERE "goals"."id" = $1  [["id", 1]]
---
  def destroy
    @goal.destroy

SELECT "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_goal
      @goal = Goal.find(params[:id])