app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Gollum"], ["LIMIT", 1]]
---
  def login
    @params = user_params
    @user = User.find_by(username: @params[:user][:username])